[
    {
        "title": "Particle Swarm Optimization",
        "thumbnail": "/images/pso_thumbnail.png",
        "description": "Particle swarm optimization (PSO) is an optimization technique based on the behaviors of flocks of birds or schools of fish. This method of optimization uses a population of particles to search a space and attempt to find the global maximum value to its given fitness function. In each iteration of the population, the velocity of a particle is determined based on its current velocity, its personal best solution, and the population’s best solution so far. The population's positions are then updated using these velocity values, and the personal bests and global best positions are updated. The iteration of this population slowly steps the population towards some local maximum of the solution space (ideally the global maximum). The goal of this project was to explore PSO’s and how their performance is affected by the input hyper-parameters of population size, inertia, cognitive weight, and social weight.",
        "gallery": [
            {
                "label": "Optimization Problem 1",
                "image": "/images/pso_q1_action.gif"
            },
            {
                "label":"Optimization Problem 2",
                "image":"/images/pso_q2_action.gif"
            }
        ],
        "misc": [
            {
                "label": "repository",
                "link": "https://github.com/cmobley4/ParticleSwarmOptimization"
            },
            {
                "label": "project report",
                "link": "/project-pages/pso-report.pdf"
            }
        ]
    },
    {
        "title": "Mechanical Engineering Senior Design",
        "thumbnail": "/images/aubo-setup.png",
        "description": "The purpose of this project was to integrate an AUBO-i5 collaborative robot with both a gripper and camera vision system to perform an object recognition and manipulation demonstration for our sponsor Aubo Robotics. This demonstration was created alongside three other members of the University of Tennessee Mechanical Engineering program. The demonstration outline was to identify parts on a table based on unique Aruco markers, pick them up, and place them in a container. In addition, the AUBO-i5 robot is a collaborative system so an additional objective was to integrate a trip laser safety system for reduced speeds and safety zones within a designated work area. Work on this project resulted in the design and creation of software for robot vision and control as well as a safety system for the robot’s active area.",
        "gallery": [
            {
                "label": "Robot Inside Workspace",
                "image": "/images/aubo-setup.png"
            },
            {
                "label": "Determining Orientations of Aruco Markers",
                "image": "/images/aruco-example.png"
            }
        ],
        "misc": [
            {
                "label": "project report",
                "link": "/project-pages/sd-report.pdf"
            },
            {
                "label": "presentation slides",
                "link": "/project-pages/sd-slides.pdf"
            },
            {
                "label": "this article",
                "link": "https://www.tnresearchpark.org/aubo-robotics-opens-research-facility-at-cherokee-farm-innovation-campus/"
            }
        ]
    }
]